Revit 2027 API
AdvancedLayered Class
 A static class that provides access to the property names that appear in the AdvancedLayered visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedLayered
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AdvancedLayered
Public NotInheritable Class AdvancedLayered
public ref class AdvancedLayered abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdvancedLayered = class end
The AdvancedLayered type exposes the following members.
Properties
Name | Description
LayeredAnisotropy |  The property labeled "Anisotropy" from the "AdvancedLayered" schema.
LayeredBottomF0 |  The property labeled "Color" from the "AdvancedLayered" schema.
LayeredDiffuse |  The property labeled "Color" from the "AdvancedLayered" schema.
LayeredF0 |  The property labeled "Clearcoat reflectance" from the "AdvancedLayered" schema.
LayeredFraction |  The property labeled "Fraction" from the "AdvancedLayered" schema.
LayeredNdfType |  The property labeled "NDF" from the "AdvancedLayered" schema.
LayeredNormal |  The property labeled "Image" from the "AdvancedLayered" schema.
LayeredRotation |  The property labeled "Rotation" from the "AdvancedLayered" schema.
LayeredRoughness |  The property labeled "Roughness" from the "AdvancedLayered" schema.
SurfaceAlbedo |  The property labeled "Color" from the "AdvancedLayered" schema.
SurfaceAnisotropy |  The property labeled "Anisotropy" from the "AdvancedLayered" schema.
SurfaceCutout |  The property labeled "Image" from the "AdvancedLayered" schema.
SurfaceNdfType |  The property labeled "NDF" from the "AdvancedLayered" schema.
SurfaceNormal |  The property labeled "Image" from the "AdvancedLayered" schema.
SurfaceRotation |  The property labeled "Rotation" from the "AdvancedLayered" schema.
SurfaceRoughness |  The property labeled "Roughness" from the "AdvancedLayered" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace